const HANGUL_OFFSET = 0xAC00;
const ONSET_OFFSET = 0x10FF;
const NUCLEUS_OFFSET = 0x1160;
const CODA_OFFSET = 0x11A7;

const ONSET = {
    'ㄱ': '\u1100',
    'ㄲ': '\u1101',
    'ㄴ': '\u1102',
    'ㄷ': '\u1103',
    'ㄸ': '\u1104',
    'ㄹ': '\u1105',
    'ㅁ': '\u1106',
    'ㅂ': '\u1107',
    'ㅃ': '\u1108',
    'ㅅ': '\u1109',
    'ㅆ': '\u110A',
    'ㅇ': '\u110B',
    'ㅈ': '\u110C',
    'ㅉ': '\u110D',
    'ㅊ': '\u110E',
    'ㅋ': '\u110F',
    'ㅌ': '\u1110',
    'ㅍ': '\u1111',
    'ㅎ': '\u1112'
}

const CODA = {
    'ㄱ': '\u11A8',
    'ㄲ': '\u11A9',
    'ㄳ': '\u11AA',
    'ㄴ': '\u11AB',
    'ㄵ': '\u11AC',
    'ㄶ': '\u11AD',
    'ㄷ': '\u11AE',
    'ㄹ': '\u11AF',
    'ㄺ': '\u11B0',
    'ㄻ': '\u11B1',
    'ㄼ': '\u11B2',
    'ㄽ': '\u11B3',
    'ㄾ': '\u11B4',
    'ㄿ': '\u11B5',
    'ㅀ': '\u11B6',
    'ㅁ': '\u11B7',
    'ㅂ': '\u11B8',
    'ㅄ': '\u11B9',
    'ㅅ': '\u11BA',
    'ㅆ': '\u11BB',
    'ㅇ': '\u11BC',
    'ㅈ': '\u11BD',
    'ㅊ': '\u11BE',
    'ㅋ': '\u11BF',
    'ㅌ': '\u11C0',
    'ㅍ': '\u11C1',
    'ㅎ': '\u11C2'
}

const VOWEL = {
    'ㅏ': '\u1161',
    'ㅐ': '\u1162',
    'ㅑ': '\u1163',
    'ㅒ': '\u1164',
    'ㅓ': '\u1165',
    'ㅔ': '\u1166',
    'ㅕ': '\u1167',
    'ㅖ': '\u1168',
    'ㅗ': '\u1169',
    'ㅘ': '\u116A',
    'ㅙ': '\u116B',
    'ㅚ': '\u116C',
    'ㅛ': '\u116D',
    'ㅜ': '\u116E',
    'ㅝ': '\u116F',
    'ㅞ': '\u1170',
    'ㅟ': '\u1171',
    'ㅠ': '\u1172',
    'ㅡ': '\u1173',
    'ㅢ': '\u1174',
    'ㅣ': '\u1175'
}

export { HANGUL_OFFSET, ONSET_OFFSET, NUCLEUS_OFFSET, CODA_OFFSET, ONSET, CODA, VOWEL };